<a href="https://colab.research.google.com/github/zacksnyder-lsds/Unit_1_build_week/blob/master/Unit_1_build_week.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Reading in the data and initial cleaning

In [0]:
#Imports for the data reading and initial cleaning section 
import pandas as pd

In [0]:
#reading in the datasets I split in a seperate notebook so I could upload to github 
url1 = 'https://raw.githubusercontent.com/zacksnyder-lsds/Unit_1_build_week/master/kiva1%20(1).csv'
url2 = 'https://raw.githubusercontent.com/zacksnyder-lsds/Unit_1_build_week/master/kiva2.csv'
url3 = 'https://raw.githubusercontent.com/zacksnyder-lsds/Unit_1_build_week/master/kiva3.csv'
url4 = 'https://raw.githubusercontent.com/zacksnyder-lsds/Unit_1_build_week/master/kiva4.csv'
url5 = 'https://raw.githubusercontent.com/zacksnyder-lsds/Unit_1_build_week/master/kiva5.csv'
url6 = 'https://raw.githubusercontent.com/zacksnyder-lsds/Unit_1_build_week/master/kiva6.csv'
url7 = 'https://raw.githubusercontent.com/zacksnyder-lsds/Unit_1_build_week/master/kiva7.csv'
url8 = 'https://raw.githubusercontent.com/zacksnyder-lsds/Unit_1_build_week/master/kiva8.csv'
url9 = 'https://raw.githubusercontent.com/zacksnyder-lsds/Unit_1_build_week/master/kiva9.csv'
url10 = 'https://raw.githubusercontent.com/zacksnyder-lsds/Unit_1_build_week/master/kiva10.csv'

In [0]:
#converting the csv files back to dataframes for use 
kiva1 = pd.read_csv(url1)
kiva2 = pd.read_csv(url2)
kiva3 = pd.read_csv(url3)
kiva4 = pd.read_csv(url4)
kiva5 = pd.read_csv(url5)
kiva6 = pd.read_csv(url6)
kiva7 = pd.read_csv(url7)
kiva8 = pd.read_csv(url8)
kiva9 = pd.read_csv(url9)
kiva10 = pd.read_csv(url10)

In [148]:
#checking to make sure all the data read in smoothly 
[print(name.shape) for name in [kiva1,kiva2,kiva3,kiva4,kiva5,kiva6,kiva7,kiva8,kiva9,kiva10]]
kiva2.head()

(67120, 21)
(67120, 21)
(67120, 21)
(67120, 21)
(67120, 21)
(67120, 21)
(67120, 21)
(67120, 21)
(67120, 21)
(67125, 21)

   Unnamed: 0       id  ...  repayment_interval        date
0       67120  1081611  ...           irregular  2014-06-03
1       67121   719419  ...           irregular  2014-06-03
2       67122   719437  ...           irregular  2014-06-03
3       67123   719717  ...             monthly  2014-06-03
4       67124   719548  ...             monthly  2014-06-03

[5 rows x 21 columns]

In [149]:
#concatinating the dataframes back together to the original from Kaggle 
kiva = pd.concat([kiva1,kiva2,kiva3,kiva4,kiva5,kiva6,kiva7,kiva8,kiva9,kiva10])
kiva.reset_index()
print(kiva.shape)
kiva.sample(5)

(671205, 21)

       Unnamed: 0       id  ...  repayment_interval        date
37685      507525  1167068  ...             monthly  2016-10-13
26028      428748  1075595  ...           irregular  2016-05-25
64754       64754   716807  ...              bullet  2014-05-27
33634      167874   816075  ...           irregular  2014-12-17
26427      294907   941259  ...           irregular  2015-09-01

[5 rows x 21 columns]

In [150]:
#getting rid of the previous index column renamed unanamed 0 
kiva.drop('Unnamed: 0', axis=1, inplace=True)
kiva.sample(5)

            id  funded_amount  ...  repayment_interval        date
5936   1055286          125.0  ...             monthly  2016-04-16
30415   945726          750.0  ...             monthly  2015-09-10
32511  1244286         5000.0  ...             monthly  2017-02-01
15215   799032          575.0  ...           irregular  2014-11-15
18823   737777          725.0  ...              bullet  2014-07-11

[5 rows x 20 columns]

#Deeper Cleaning

###grabbing just the top 25 countries

In [151]:
#finding the top 25 countries that Kiva serves 
top_code = kiva['country_code'].value_counts()[:26].index
top_code

Index(['PH', 'KE', 'SV', 'KH', 'PK', 'PE', 'CO', 'UG', 'TJ', 'EC', 'PY', 'NI',
       'IN', 'VN', 'NG', 'BO', 'LB', 'AM', 'PS', 'WS', 'GT', 'RW', 'ML', 'HN',
       'ID', 'US'],
      dtype='object')

In [152]:
#finding out what percentage of the loans by Kiva fall in the top 25 countries 
a = kiva['country_code'].value_counts()[:26].sum()
b = kiva['country_code'].value_counts().sum()
percent_described = a/b
print(percent_described*100, '% of the loans occur in the top 25 countries')

85.37046500505812 % of the loans occur in the top 25 countries

In [153]:
#creating a column for top 25 countries 
kiva['top_25_countries'] = 'Other'
kiva['top_25_countries'].sample(5)

5220     Other
39452    Other
51306    Other
59318    Other
18050    Other
Name: top_25_countries, dtype: object

In [154]:
#locking just the top 25 countries 
for code in top_code:
  kiva.loc[kiva['country_code'] == code, 'top_25_countries'] = code
kiva[['top_25_countries','country_code']].sample(10)

      top_25_countries country_code
50456               KE           KE
121                 VN           VN
52126               LB           LB
38970            Other           AL
5205                PK           PK
8511                GT           GT
38829               KE           KE
27237               KE           KE
46120               KH           KH
52785            Other           SL

In [155]:
#getting rid of the unneeded column to keep things tidy 
kiva.drop('country_code', axis=1, inplace=True)
kiva.sample(3)

            id  funded_amount  ...        date top_25_countries
32425   684918         1000.0  ...  2014-03-18               KH
15043   997096           75.0  ...  2015-12-18               PH
37865  1019999          275.0  ...  2016-02-09               PH

[3 rows x 20 columns]

###grabbing just single borrowers

In [0]:
#creating a column for single borrowers 
kiva['single_gender'] = 'More than 1 borrower'

In [157]:
#locking the single borrowers to thier gender 
kiva.loc[kiva['borrower_genders'] == 'male', 'single_gender'] = 'male'
kiva.loc[kiva['borrower_genders'] == 'female', 'single_gender'] = 'female'
kiva[['single_gender', 'borrower_genders']].sample(10)

              single_gender                                   borrower_genders
55830                  male                                               male
55076                female                                             female
59022                female                                             female
11606                female                                             female
61742  More than 1 borrower  female, female, female, female, female, female...
56876                female                                             female
4577   More than 1 borrower  female, female, female, female, female, female...
28653                female                                             female
44925                female                                             female
41532                female                                             female

In [158]:
#getting rid of the unneeded column 
kiva.drop('borrower_genders', axis=1, inplace=True)
kiva.head()

       id  funded_amount  ...  top_25_countries         single_gender
0  653051          300.0  ...                PK                female
1  653053          575.0  ...                PK  More than 1 borrower
2  653068          150.0  ...                IN                female
3  653063          200.0  ...                PK                female
4  653084          400.0  ...                PK                female

[5 rows x 20 columns]

###Trimming the fat

In [159]:
#determining what columns will be useful for my analysis 
list(kiva.columns)

['id',
 'funded_amount',
 'loan_amount',
 'activity',
 'sector',
 'use',
 'country',
 'region',
 'currency',
 'partner_id',
 'posted_time',
 'disbursed_time',
 'funded_time',
 'term_in_months',
 'lender_count',
 'tags',
 'repayment_interval',
 'date',
 'top_25_countries',
 'single_gender']

I want to isolate loan_amount, sector, use, activity, top 25 countries and single gender

In [160]:
#isolating the columns
clean_columns = ['loan_amount', 'sector', 'use', 'activity', 'top_25_countries', 'single_gender']

kiva_clean = pd.concat([pd.DataFrame(kiva[column]) for column in clean_columns], axis=1)
kiva_clean.sample(5)

       loan_amount        sector  ... top_25_countries         single_gender
54946        950.0        Retail  ...            Other                female
15471        225.0        Retail  ...               PH                female
62331        225.0  Personal Use  ...               KH  More than 1 borrower
651          125.0  Personal Use  ...               KH  More than 1 borrower
51361        225.0       Housing  ...               PH                female

[5 rows x 6 columns]

In [0]:
#defining a fucntion to drop the unwanted parts of the column 
def p90x(data, column, unwanted):
  data.set_index(data[column], inplace=True)
  data.drop(unwanted, inplace=True)
  data.drop(column, axis=1,inplace=True)
  data.reset_index(inplace=True)

In [162]:
#running the function on top_25_countries and single_gender
p90x(kiva_clean, 'top_25_countries', 'Other')
p90x(kiva_clean, 'single_gender', 'More than 1 borrower')
kiva_clean.sample(10)

       single_gender  ...                   activity
87455         female  ...                    Farming
284660        female  ...            Home Appliances
283654        female  ...      Food Production/Sales
345517          male  ...              Manufacturing
129603          male  ...  Personal Housing Expenses
86226           male  ...             Transportation
314042        female  ...                   Hardware
344257        female  ...                    Farming
355652        female  ...                    Farming
487129          male  ...                Agriculture

[10 rows x 6 columns]